off/stator/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 101.629889;

boundaryField
{

    Inlet
	{
        type            zeroGradient;
	}

    
    Outlet
	{
        type            zeroGradient;
	}

    "(Wall|External)"
    {
        type            zeroGradient;
    }

    "(AMI_1|AMI_2)"
    {
		type			cyclicAMI;
	}
}

// ************************************************************************* //
