off/stator/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 4593.75;

boundaryField
{
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform 4593.75; 
    }
    
    Outlet
    {
        type            inletOutlet;
        inletValue      uniform 4593.75;
    }

    External
    {
        type            inletOutlet;
        inletValue      uniform 4593.7;
    }


    Wall
    {
        type            omegaWallFunction;
	      value		        $internalField;
    }

    "(AMI_1|AMI_2)"
    {
        type            cyclicAMI;
    }

}


// ************************************************************************* //
