off/stator/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

	{
		name	AMI1;
		type	faceSet;
		action  new;
		source  patchToFace;
		sourceInfo
		{
			name	AMI_1;
		}
	}


	{
		name	AMI1;
		type	faceSet;
		action  add;
		source  patchToFace;
		sourceInfo
		{
			name	AMI_2;
		}
	}

);

// ************************************************************************* //
